---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.RouteAnalysisSettings
source: html/ad409b06-c46b-88b9-b427-0099114d6ab1.htm
---
# RouteAnalysisSettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.